nrfconnect/sdk-nrf/subsys/mpsl/fem/hot_potato/radio_test_nrf54l/src/radio_test.c
/*
 * Copyright (c) 2020-2025 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: LicenseRef-Nordic-5-Clause
 */

#include "radio_test.h"

#include <string.h>
#include <inttypes.h>
#include <errno.h>

#include <zephyr/drivers/clock_control/nrf_clock_control.h>
#include <zephyr/kernel.h>
#include <zephyr/sys/util.h>
#include <zephyr/random/random.h>

#include <hal/nrf_egu.h>
#include <hal/nrf_power.h>
#include <mdk/nrf_erratas.h>
#include <hal/nrf_regulators.h>
#include <helpers/nrfx_gppi.h>
#include <nrfx_timer.h>

#include <mpsl/mpsl_lib.h>

/* IEEE 802.15.4 default frequency. */
#define IEEE_DEFAULT_FREQ         (5)
/* Length on air of the LENGTH field. */
#define RADIO_LENGTH_LENGTH_FIELD (8UL)

#define RADIO_TEST_EGU_EVENT NRF_EGU_EVENT_TRIGGERED0
#define RADIO_TEST_EGU_TASK  NRF_EGU_TASK_TRIGGER0

/* Frequency calculation for a given channel in the IEEE 802.15.4 radio
 * mode.
 */
#define IEEE_FREQ_CALC(_channel) (IEEE_DEFAULT_FREQ + \
				 (IEEE_DEFAULT_FREQ * \
				 ((_channel) - IEEE_MIN_CHANNEL)))
/* Frequency calculation for a given channel. */
#define CHAN_TO_FREQ(_channel) (2400 + _channel)

#if defined(CONFIG_SOC_SERIES_NRF54HX)
#define RADIO_TEST_EGU            NRF_EGU020
#define RADIO_TEST_TIMER_INSTANCE 020
#define RADIO_TEST_TIMER_IRQn     TIMER020_IRQn
#define RADIO_TEST_RADIO_IRQn     RADIO_0_IRQn
#define NRF_RADIO_SHORT_END_DISABLE_MASK NRF_RADIO_SHORT_PHYEND_DISABLE_MASK
#elif defined(CONFIG_SOC_SERIES_NRF54LX)
#define RADIO_TEST_EGU            NRF_EGU10
#define RADIO_TEST_TIMER_INSTANCE 10
#define RADIO_TEST_TIMER_IRQn     TIMER10_IRQn
#define RADIO_TEST_RADIO_IRQn     RADIO_0_IRQn
#define NRF_RADIO_SHORT_END_DISABLE_MASK NRF_RADIO_SHORT_PHYEND_DISABLE_MASK
#else
#define RADIO_TEST_EGU            NRF_EGU0
#define RADIO_TEST_TIMER_INSTANCE 0
#define RADIO_TEST_TIMER_IRQn     TIMER0_IRQn
#define RADIO_TEST_RADIO_IRQn     RADIO_IRQn
#endif /* defined(CONFIG_SOC_SERIES_NRF54HX) */

#define RADIO_TEST_TIMER_IRQ_HANDLER                                                               \
	NRFX_CONCAT_3(nrfx_timer_, RADIO_TEST_TIMER_INSTANCE, _irq_handler)

#define ENDPOINT_EGU_RADIO_TX	BIT(1)
#define ENDPOINT_EGU_RADIO_RX	BIT(2)
#define ENDPOINT_TIMER_RADIO_TX BIT(3)
#define ENDPOINT_FORK_EGU_TIMER BIT(4)

extern void TIMER10_IRQHandler(void);

/* Buffer for the radio TX packet */
static uint8_t tx_packet[RADIO_MAX_PAYLOAD_LEN];
/* Buffer for the radio RX packet. */
static uint8_t rx_packet[RADIO_MAX_PAYLOAD_LEN];
/* Number of transmitted packets. */
static uint32_t tx_packet_cnt;
/* Number of received packets with valid CRC. */
static uint32_t rx_packet_cnt;

/* Radio current channel (frequency). */
static uint8_t current_channel;

/* Timer used for channel sweeps and tx with duty cycle. */
static nrfx_timer_t timer =
	NRFX_TIMER_INSTANCE(NRF_TIMER_INST_GET(RADIO_TEST_TIMER_INSTANCE));

static bool sweep_processing;

/* Total payload size */
static uint16_t total_payload_size;

/* PPI channel for starting radio */
static nrfx_gppi_handle_t ppi_radio_start;

/* PPI endpoint status.*/
static atomic_t endpoint_state;

/* RSSI samples of received packets */
static uint8_t rssi_sample_latest_packets[MAX_RSSISAMPLE_STORED];
static uint32_t rssi_sample_current_index = 0;

// extern void RADIO_TEST_TIMER_IRQ_HANDLER(void);

uint8_t rssi_sample_averaged_packets_get(uint32_t num_rssi_samples)
{
	uint32_t current_index = num_rssi_samples;
	uint64_t averaged_rssi = 0;
	for (int i = 0; i < num_rssi_samples; i++) {
		averaged_rssi += rssi_sample_latest_packets[current_index];
		if (current_index == 0) {
			current_index = MAX_RSSISAMPLE_STORED;
		} else {
			current_index--;
		}
	}
	averaged_rssi /= num_rssi_samples;
	return (uint8_t)averaged_rssi;
}

static uint16_t channel_to_frequency(nrf_radio_mode_t mode, uint8_t channel)
{
#if CONFIG_HAS_HW_NRF_RADIO_IEEE802154
	if (mode == NRF_RADIO_MODE_IEEE802154_250KBIT) {
		if ((channel >= IEEE_MIN_CHANNEL) && (channel <= IEEE_MAX_CHANNEL)) {
			return CHAN_TO_FREQ(IEEE_FREQ_CALC(channel));
		} else {
			return CHAN_TO_FREQ(IEEE_DEFAULT_FREQ);
		}
	} else {
		return CHAN_TO_FREQ(channel);
	}
#else
	return CHAN_TO_FREQ(channel);
#endif /* CONFIG_HAS_HW_NRF_RADIO_IEEE802154 */
}

static nrf_radio_txpower_t dbm_to_nrf_radio_txpower(int8_t tx_power)
{
	switch (tx_power) {
#if defined(RADIO_TXPOWER_TXPOWER_Neg70dBm)
	case -70:
		return RADIO_TXPOWER_TXPOWER_Neg70dBm;
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg70dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Neg46dBm)
	case -46:
		return RADIO_TXPOWER_TXPOWER_Neg46dBm;
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg46dBm) */

	case -40:
		return RADIO_TXPOWER_TXPOWER_Neg40dBm;

#if defined(RADIO_TXPOWER_TXPOWER_Neg30dBm)
	case -30:
		return RADIO_TXPOWER_TXPOWER_Neg30dBm;
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg30dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Neg26dBm)
	case -26:
		return RADIO_TXPOWER_TXPOWER_Neg26dBm;
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg26dBm) */

	case -20:
		return RADIO_TXPOWER_TXPOWER_Neg20dBm;

	case -16:
		return RADIO_TXPOWER_TXPOWER_Neg16dBm;

#if defined(RADIO_TXPOWER_TXPOWER_Neg14dBm)
	case -14:
		return RADIO_TXPOWER_TXPOWER_Neg14dBm;
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg14dBm) */

	case -12:
		return RADIO_TXPOWER_TXPOWER_Neg12dBm;

#if defined(RADIO_TXPOWER_TXPOWER_Neg10dBm)
	case -10:
		return RADIO_TXPOWER_TXPOWER_Neg10dBm;
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg10dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Neg9dBm)
	case -9:
		return RADIO_TXPOWER_TXPOWER_Neg9dBm;
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg9dBm) */

	case -8:
		return RADIO_TXPOWER_TXPOWER_Neg8dBm;

#if defined(RADIO_TXPOWER_TXPOWER_Neg7dBm)
	case -7:
		return RADIO_TXPOWER_TXPOWER_Neg7dBm;
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg7dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Neg6dBm)
	case -6:
		return RADIO_TXPOWER_TXPOWER_Neg6dBm;
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg6dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Neg5dBm)
	case -5:
		return RADIO_TXPOWER_TXPOWER_Neg5dBm;
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg5dBm) */

	case -4:
		return RADIO_TXPOWER_TXPOWER_Neg4dBm;

#if defined(RADIO_TXPOWER_TXPOWER_Neg3dBm)
	case -3:
		return RADIO_TXPOWER_TXPOWER_Neg3dBm;
#endif /* defined (RADIO_TXPOWER_TXPOWER_Neg3dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Neg2dBm)
	case -2:
		return RADIO_TXPOWER_TXPOWER_Neg2dBm;
#endif /* defined (RADIO_TXPOWER_TXPOWER_Neg2dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Neg1dBm)
	case -1:
		return RADIO_TXPOWER_TXPOWER_Neg1dBm;
#endif /* defined (RADIO_TXPOWER_TXPOWER_Neg1dBm) */

	case 0:
		return RADIO_TXPOWER_TXPOWER_0dBm;

