nrfconnect/sdk-nrf/subsys/mpsl/fem/hot_potato/radio_test_nrf54l/src/radio_test.c
#endif /* CONFIG_HAS_HW_NRF_RADIO_IEEE802154 || CONFIG_HAS_HW_NRF_RADIO_BLE_CODED */

	case NRF_RADIO_MODE_BLE_1MBIT:
	case NRF_RADIO_MODE_BLE_2MBIT:
	case NRF_RADIO_MODE_NRF_1MBIT:
	case NRF_RADIO_MODE_NRF_2MBIT:
	default:
#if defined(RADIO_MODE_MODE_Nrf_250Kbit)
	case NRF_RADIO_MODE_NRF_250KBIT:
#endif /* defined(RADIO_MODE_MODE_Nrf_250Kbit) */
#if defined(RADIO_MODE_MODE_Nrf_4Mbit0_5)
	case NRF_RADIO_MODE_NRF_4MBIT_H_0_5:
#endif /* defined(RADIO_MODE_MODE_Nrf_4Mbit0_5) */
#if defined(RADIO_MODE_MODE_Nrf_4Mbit0_25)
	case NRF_RADIO_MODE_NRF_4MBIT_H_0_25:
#endif /* defined(RADIO_MODE_MODE_Nrf_4Mbit0_25) */
		nrf_radio_shorts_enable(NRF_RADIO, NRF_RADIO_SHORT_READY_START_MASK |
							   NRF_RADIO_SHORT_END_START_MASK);
		break;
	}

	radio_mode_set(NRF_RADIO, mode);
	radio_power_set(mode, channel, txpower);

	radio_channel_set(mode, channel);

	tx_packet_cnt = 0;

	nrf_radio_event_clear(NRF_RADIO, NRF_RADIO_EVENT_END);
	if (packets_num != 0U) {
		nrf_radio_int_enable(NRF_RADIO, NRF_RADIO_INT_END_MASK);
	}

	radio_start(false, false);
}

static void radio_rx(uint8_t mode, uint8_t channel, enum transmit_pattern pattern, bool crc_enabled)
{
	radio_disable();

	radio_mode_set(NRF_RADIO, mode);

	nrf_radio_shorts_enable(NRF_RADIO, NRF_RADIO_SHORT_READY_START_MASK |
						   NRF_RADIO_SHORT_END_START_MASK |
						   NRF_RADIO_SHORT_ADDRESS_RSSISTART_MASK);
	nrf_radio_packetptr_set(NRF_RADIO, rx_packet);

	radio_config(mode, pattern, RADIO_MAX_PAYLOAD_LEN, crc_enabled);
	radio_channel_set(mode, channel);

	rx_packet_cnt = 0;

	nrf_radio_int_enable(NRF_RADIO, NRF_RADIO_INT_CRCOK_MASK);

	if (sweep_processing) {
		radio_ppi_config(true);
	}

	radio_start(true, sweep_processing);
}

static void radio_sweep_start(uint8_t channel, uint32_t delay_ms)
{
	current_channel = channel;

	nrfx_timer_disable(&timer);
	nrf_timer_shorts_disable(timer.p_reg, ~0);
	nrf_timer_int_disable(timer.p_reg, ~0);

	nrfx_timer_extended_compare(
		&timer, NRF_TIMER_CC_CHANNEL0, nrfx_timer_ms_to_ticks(&timer, delay_ms),
		(NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK | NRF_TIMER_SHORT_COMPARE0_STOP_MASK), true);

	nrfx_timer_enable(&timer);
}

static void radio_modulated_tx_carrier_duty_cycle(uint8_t mode, int8_t txpower, uint8_t channel,
						  enum transmit_pattern pattern,
						  uint32_t duty_cycle, bool crc_enabled)
{
	/* Lookup table with time per byte in each radio MODE
	 * Mapped per NRF_RADIO->MODE available on nRF5-series devices
	 */
	static const uint8_t time_in_us_per_byte[16] = {8, 4, 32, 8, 4, 64, 16, 0,
							0, 0, 0,  0, 0, 0,  0,	32};

	radio_disable();
	generate_modulated_rf_packet(mode, pattern, RADIO_MAX_PAYLOAD_LEN, crc_enabled);

	radio_mode_set(NRF_RADIO, mode);
	nrf_radio_shorts_enable(NRF_RADIO, NRF_RADIO_SHORT_READY_START_MASK |
						   NRF_RADIO_SHORT_END_DISABLE_MASK);
	radio_power_set(mode, channel, txpower);
	radio_channel_set(mode, channel);

	const uint32_t total_time_per_payload = time_in_us_per_byte[mode] * total_payload_size;

	/* Duty cycle = 100 * Time_on / (time_on + time_off),
	 * we need to calculate "time_off" for delay.
	 * In addition, the timer includes the "total_time_per_payload",
	 * so we need to add this to the total timer cycle.
	 */
	uint32_t delay_time =
		total_time_per_payload +
		((100 * total_time_per_payload - (total_time_per_payload * duty_cycle)) /
		 duty_cycle);

	/* We let the TIMER start the radio transmission again. */
	nrfx_timer_disable(&timer);

	radio_ppi_config(false);

	nrf_timer_shorts_disable(timer.p_reg, ~0);
	nrf_timer_int_disable(timer.p_reg, ~0);

	nrfx_timer_extended_compare(&timer, NRF_TIMER_CC_CHANNEL1,
				    nrfx_timer_us_to_ticks(&timer, delay_time),
				    NRF_TIMER_SHORT_COMPARE1_CLEAR_MASK, false);

	unsigned int key = irq_lock();

	radio_start(false, true);

	radio_ppi_tx_reconfigure();
	irq_unlock(key);
}

static void radio_modulated_tx_carrier_interval(uint8_t mode, int8_t txpower, uint8_t channel,
						enum transmit_pattern pattern, uint32_t interval,
						uint32_t payload_size, bool crc_enabled)
{
	radio_disable();
	generate_modulated_rf_packet(mode, pattern, payload_size, crc_enabled);

	radio_mode_set(NRF_RADIO, mode);
	nrf_radio_shorts_enable(NRF_RADIO, NRF_RADIO_SHORT_READY_START_MASK |
						   NRF_RADIO_SHORT_END_DISABLE_MASK);
	radio_power_set(mode, channel, txpower);
	radio_channel_set(mode, channel);

	/* We let the TIMER start the radio transmission again. */
	nrfx_timer_disable(&timer);

	radio_ppi_config(false);

	nrf_timer_shorts_disable(timer.p_reg, ~0);
	nrf_timer_int_disable(timer.p_reg, ~0);

	nrfx_timer_extended_compare(&timer, NRF_TIMER_CC_CHANNEL1,
				    nrfx_timer_ms_to_ticks(&timer, interval),
				    NRF_TIMER_SHORT_COMPARE1_CLEAR_MASK, false);

	unsigned int key = irq_lock();

	radio_start(false, true);

	radio_ppi_tx_reconfigure();
	irq_unlock(key);
}

void radio_test_start(const struct radio_test_config *config)
{
	switch (config->type) {
	case UNMODULATED_TX:
		radio_unmodulated_tx_carrier(config->mode,
			config->params.unmodulated_tx.txpower,
			config->params.unmodulated_tx.channel);
		break;
	case MODULATED_TX:
		radio_modulated_tx_carrier(config->mode,
			config->params.modulated_tx.txpower,
			config->params.modulated_tx.channel,
			config->params.modulated_tx.pattern,
			config->params.modulated_tx.packets_num,
			config->params.modulated_tx.payload_size,
			config->crc_enabled);
		printk("Payload size (bytes): %d\r\n", config->params.modulated_tx.payload_size);
		printk("Total payload size (bits): %d\r\n", total_payload_size*8);
		break;
	case RX:
		radio_rx(config->mode,
			config->params.rx.channel,
			config->params.rx.pattern,
			config->crc_enabled);
		break;
	case TX_SWEEP:
		radio_sweep_start(config->params.tx_sweep.channel_start,
			config->params.tx_sweep.delay_ms);
		break;
	case RX_SWEEP:
		radio_sweep_start(config->params.rx_sweep.channel_start,
			config->params.rx_sweep.delay_ms);
		break;
	case MODULATED_TX_DUTY_CYCLE:
		radio_modulated_tx_carrier_duty_cycle(config->mode,
			config->params.modulated_tx_duty_cycle.txpower,
			config->params.modulated_tx_duty_cycle.channel,
			config->params.modulated_tx_duty_cycle.pattern,
			config->params.modulated_tx_duty_cycle.duty_cycle,
			config->crc_enabled);
		break;
    case MODULATED_TX_INTERVAL:
		radio_modulated_tx_carrier_interval(config->mode,
			config->params.modulated_tx_interval.txpower,
			config->params.modulated_tx_interval.channel,
			config->params.modulated_tx_interval.pattern,
			config->params.modulated_tx_interval.interval,
            config->params.modulated_tx_interval.payload_size,
			config->crc_enabled);
		printk("Payload size (bytes): %d\r\n", config->params.modulated_tx.payload_size);
		printk("Total payload size (bits): %d\r\n", total_payload_size*8);
		break;
	}
}

void radio_test_cancel(void)
{
	nrfx_timer_disable(&timer);
	nrfx_timer_clear(&timer);

	sweep_processing = false;

	nrfx_gppi_conn_disable(ppi_radio_start);

	rssi_sample_current_index = 0;

	endpoints_clear();
	radio_disable();
}

